tests/taurus/routing/driving-car.yml
---
execution:
- concurrency: 2000
  ramp-up: 1m
  hold-for: 5m
  scenario: routing

scenarios:
  routing:
    requests:
    - http://129.206.7.231/v1/test/routing?profile=driving-car&coordinates=8.690614,49.38365%7C8.7007,49.411699%7C8.7107,49.45169&instructions=false&geometry_format=polyline&api_key=f063f9a4600144b6b1c85356b24f4a63

reporting:
    - module: blazemeter
      report-name: OpenRouteService Routing API Concurrency Performance